{
  "class_names": [
      "Acne", 
      "Arthritis", 
      "Bronchial Asthma", 
      "Cervical Spondylosis", 
      "Chicken Pox", 
      "Common Cold", 
      "Dengue", 
      "Dimorphic Hemorrhoids", 
      "Fungal Infection", 
      "Hypertension", 
      "Impetigo", 
      "Jaundice", 
      "Malaria", 
      "Migraine", 
      "Pneumonia", 
      "Psoriasis", 
      "Typhoid", 
      "Varicose Veins", 
      "Allergy", 
      "Diabetes", 
      "Drug Reaction", 
      "Gastroesophageal Reflux Disease", 
      "Peptic Ulcer Disease", 
      "Urinary Tract Infection"
  ],
  "advice": {
      "Acne": "Maintain a proper skincare routine, avoid excessive touching of the affected areas, and consider using over-the-counter topical treatments. If severe, consult a dermatologist.",
      "Arthritis": "Stay active with gentle exercises, manage weight, and consider pain-relief strategies like hot/cold therapy. Consult a rheumatologist for tailored guidance.",
      "Bronchial Asthma": "Follow prescribed inhaler and medication regimen, avoid triggers like smoke and allergens, and have an asthma action plan. Regular check-ups with a pulmonologist are important.",
      "Cervical Spondylosis": "Practice good posture, avoid heavy lifting, and consider neck exercises or physical therapy. Consult an orthopedist for specialized care.",
      "Chicken Pox": "Avoid scratching the rash, take antihistamines to relieve itching, and ensure rest. Consult a doctor if complications arise.",
      "Common Cold": "Stay hydrated, rest, and use over-the-counter medications to relieve symptoms. If persistent, consult a doctor.",
      "Dengue": "Stay hydrated, monitor fever, and avoid NSAIDs like ibuprofen. Seek immediate medical attention for severe symptoms.",
      "Dimorphic Hemorrhoids": "Maintain a high-fiber diet, stay hydrated, and use prescribed creams or treatments. Consult a proctologist if symptoms persist.",
      "Fungal Infection": "Keep affected areas clean and dry, apply antifungal creams, and avoid sharing personal items. Consult a dermatologist for persistent infections.",
      "Hypertension": "Monitor blood pressure regularly, maintain a healthy diet, exercise, and reduce stress. Consult a cardiologist for tailored treatment.",
      "Impetigo": "Keep the infected area clean, avoid scratching, and use prescribed topical or oral antibiotics. Consult a dermatologist if needed.",
      "Jaundice": "Rest, maintain a balanced diet, and avoid alcohol. Consult a hepatologist for liver health management.",
      "Malaria": "Follow prescribed antimalarial medication, rest, and stay hydrated. Consult a doctor for proper treatment.",
      "Migraine": "Identify and avoid triggers, use prescribed pain relievers, and practice stress-reducing techniques. Consult a neurologist if migraines persist.",
      "Pneumonia": "Rest, stay hydrated, and take prescribed antibiotics or antivirals. Regular follow-ups with a pulmonologist may be necessary.",
      "Psoriasis": "Keep skin moisturized, avoid triggers like stress, and use prescribed topical treatments. Consult a dermatologist for advanced care.",
      "Typhoid": "Maintain hydration, follow a prescribed antibiotic course, and eat light, nutritious food. Consult a doctor for recovery monitoring.",
      "Varicose Veins": "Exercise regularly, avoid prolonged standing, and use compression stockings. Consult a vascular specialist for severe cases.",
      "Allergy": "Identify and avoid allergens, use antihistamines or prescribed medications, and consult an allergist for severe reactions.",
      "Diabetes": "Follow a balanced diet, exercise, monitor blood sugar levels, and take prescribed medications. Regular visits to an endocrinologist are essential.",
      "Drug Reaction": "Stop the suspected medication, take antihistamines if mild, and seek immediate medical attention for severe reactions. Consult a doctor for further advice.",
      "Gastroesophageal Reflux Disease": "Avoid trigger foods, eat smaller meals, and use prescribed antacids or proton pump inhibitors. Consult a gastroenterologist for persistent symptoms.",
      "Peptic Ulcer Disease": "Avoid NSAIDs, alcohol, and spicy foods. Take prescribed medications and consult a gastroenterologist for treatment.",
      "Urinary Tract Infection": "Stay hydrated, take prescribed antibiotics, and maintain good hygiene. Consult a doctor for appropriate treatment."
  }
}
